## belajar pandas (3)

In [1]:
import numpy as np
import pandas as pd
import os
os.getcwd()

'c:\\Users\\Farid Rahman\\Desktop\\Dropbox\\JCDS\\Module 02'

In [2]:
df=pd.read_csv('misc/filebaru.csv')
df=df.replace({
    "usia": "#"
}, np.NaN)
df

   nama usia       kota       gaji
0  andi   21    jakarta  5000000.0
1  budi   22    bandung  6000000.0
2  caca   23      bogor  7000000.0
3  euis   24   surabaya  7000000.0
4  deni   25   semarang  8000000.0
5     -   26      depok  7500000.0
6  miki   27  tangerang  7600000.0
7  kiki   28        n.a        NaN
8  kuku   30          0        NaN
9  meri  NaN    8700000        NaN

In [3]:
df=pd.DataFrame([
    {'nama':'Andi', 'nilai' :90},
    {'nama':'Andi', 'nilai' :91},
    {'nama':'Andi', 'nilai' :92},
    {'nama':'Budi', 'nilai' :93},
    {'nama':'Budi', 'nilai' :94},
    {'nama':'Budi', 'nilai' :95}
])
df
dfGroup=df.groupby('nama')
dfGroup.get_group('Budi')
dfGroup.groups.keys()
dfGroup.mean()
dfGroup.max()

      nilai
nama
Andi     92
Budi     95

In [4]:
df=pd.DataFrame([
    {'nama':'Andi', 'fisika' :90, 'biologi':80},
    {'nama':'Andi', 'fisika' :91,'biologi':81},
    {'nama':'Andi', 'fisika' :92,'biologi':82},
    {'nama':'Budi', 'fisika' :93,'biologi':83},
    {'nama':'Budi', 'fisika' :94,'biologi':84},
    {'nama':'Budi', 'fisika' :95,'biologi':95}
])
df
dfGroup=df.groupby('nama')
print(dfGroup)
print(dfGroup.get_group('Budi'))
print(dfGroup.groups.keys())
print(dfGroup.mean())
print(dfGroup.max())

print(df[df['nama'] == 'Andi']['fisika'].max())
print(dfGroup.get_group('Andi')['fisika'].max())

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x00000211A571A0D0>
   nama  fisika  biologi
3  Budi      93       83
4  Budi      94       84
5  Budi      95       95
dict_keys(['Andi', 'Budi'])
      fisika    biologi
nama
Andi    91.0  81.000000
Budi    94.0  87.333333
      fisika  biologi
nama
Andi      92       82
Budi      95       95
92
92

In [5]:
df1=pd.DataFrame([
    {'nama':'Andi', 'fisika' :90, 'biologi':80},
    {'nama':'Budi', 'fisika' :91,'biologi':81},
    {'nama':'Caca', 'fisika' :92,'biologi':82}
])
df2=pd.DataFrame([
    {'nama':'Doni', 'fisika' :90, 'biologi':80, 'matematika': 70},
    {'nama':'Ella', 'fisika' :91,'biologi':81},
    {'nama':'Andi', 'kimia' :92,'olah raga':82}
])

'''
df3=pd.DataFrame([
    {'nama':'Doni', 'kimia' :90, 'agama':80, 'mulok': 70},
    {'nama':'Ella', 'kimia' :91,'agama':81},
    {'nama':'Fira', 'kimia' :92,'agama':82}
])
'''

arr=[['mata pelajaran'],['fisika','biologi','matematika','olahraga']]
multindex=pd.MultiIndex.from_product(arr)
print(type(multindex))
print(multindex)

new_df=pd.concat([df1,df2,df3], ignore_index=True, sort=False, axis=0)
print("new_df\n", new_df)
new_df_merge=pd.merge(df1,df2, how='outer', on='nama')
new_df_merge

<class 'pandas.core.indexes.multi.MultiIndex'>
MultiIndex([('mata pelajaran',     'fisika'),
            ('mata pelajaran',    'biologi'),
            ('mata pelajaran', 'matematika'),
            ('mata pelajaran',   'olahraga')],
           )

NameError: name 'df3' is not defined

## Multiindex and pivot

In [0]:
kamus=[
    {'nomor':1, 'nama':'Andi', 'fisika': 90, 'biologi': 78},
    {'nomor':2, 'nama':'Andi', 'fisika': 91, 'biologi': 77},
    {'nomor':3, 'nama':'Andi', 'fisika': 92, 'biologi': 76},
    {'nomor':1, 'nama':'Budi', 'fisika': 93, 'biologi': 75},
    {'nomor':2, 'nama':'Budi', 'fisika': 95, 'biologi': 74},
    {'nomor':3, 'nama':'Budi', 'fisika': 90, 'biologi': 73},
]
df=pd.DataFrame(kamus)
print(df)
new_df1=df.pivot(index='nama', columns='nomor')
new_df2=df.pivot(index='nomor', columns='nama')
print("new_df1")
print(new_df1)
print("new_df2")
print(new_df2)
print(new_df.columns)
print('''


''')
new_df2['fisika','Andi'][1]

In [0]:
df=pd.DataFrame({
    # 'mata pelajaran': ['biologi', 'biologi', 'matematika', 'matematika'],
    # 'nama': ['andi', 'budi', 'andi', 'budi'],
    'nilai1': [90,91,72,71],
    'nilai2': [65,66,67,68]
}, index=[['biologi', 'biologi', 'matematika', 'matematika'],['andi', 'budi', 'andi', 'budi']])
df

In [0]:
df=pd.DataFrame({
    'mapel': ['biologi', 'biologi', 'biologi', 'fisika', 'fisika', 'fisika'],
    'test': [1,2,3,1,2,3],
    'Andi': [70,80,90,76,78,98],
    'Budi': [67,76,54,45,67,89]
})
print(df)
df=df.set_index(['test','mapel'])
print(df)
df=df.unstack() #=> biar si dataframe itu jadi single index
print(df)
print("\nswap level")
df=df.swaplevel(0,1,1).sort_index(1)
print(df)
df.columns

In [0]:
df1=pd.DataFrame([
    {'nama':'Andi', 'fisika' :90, 'biologi':80},
    {'nama':'Budi', 'fisika' :91,'biologi':81},
    {'nama':'Caca', 'fisika' :92,'biologi':82}
])
df2=pd.DataFrame([
    {'nama':'Doni', 'fisika' :90, 'biologi':80, 'matematika': 70},
    {'nama':'Ella', 'fisika' :91,'biologi':81},
    {'nama':'Andi', 'kimia' :92,'olah raga':82}
])
df=pd.concat([df1,df2], sort=False, keys=['satu', 'dua'])
print(df.index)
print(df.columns)
print(df)

# PR
1. data BPS, baca sebagai multi index, kerjain tugas2nya
2. pd.melt
3. pd.crosstab
4. pd.read_sql => membaca query
4. pd_read_sql_table => membaca table langsung

In [128]:
df=pd.read_excel('misc/bps_file.xlsx', header=[2,3], skipfooter=1, na_values=['-'])
print(df.columns)
# df.rename(columns={'Unnamed: 0_level_0':"", 'Unnamed: 0_level_1': "Provinsi"}, inplace=True)
# df.set_index(("","Provinsi"),inplace=True)
df.set_index(('Unnamed: 0_level_0', 'Unnamed: 0_level_1'), inplace=True)
# df.rename(index={'(, Provinsi)': 'Provinsi'}, inplace=True)
df.index.names=['Provinsi']
df.columns.names=['Area','Tahun']
# new_df=df[[('Tepi Laut', 2003),('Bukan Tepi Laut', 2003)]]
# new_df['total']=df[('Tepi Laut', 2003)] + df[('Bukan Tepi Laut', 2003)]
# new_df[new_df['total'] == new_df['total'].max()]
arr=[]
for i in df.columns:
    arr.append(i[1])
arr.sort()
arr=set(arr)
print("===========menampilakan desa terbanyak=================")
for j in arr:
    new_df=df[[('Tepi Laut', j),('Bukan Tepi Laut', j)]]
    new_df['total']=df[('Tepi Laut', j)] + df[('Bukan Tepi Laut', j)]
    print(new_df[new_df['total'] == new_df['total'].max()])
    print("")

print("===========menampilakan desa tersedikit=================")
for j in arr:
    new_df=df[[('Tepi Laut', j),('Bukan Tepi Laut', j)]]
    new_df['total']=df[('Tepi Laut', j)] + df[('Bukan Tepi Laut', j)]
    print(new_df[new_df['total'] == new_df['total'].min()])
    print("")


print('''



''')
df

MultiIndex([('Unnamed: 0_level_0', 'Unnamed: 0_level_1'),
            (         'Tepi Laut',                 2003),
            (         'Tepi Laut',                 2005),
            (         'Tepi Laut',                 2008),
            (         'Tepi Laut',                 2011),
            (         'Tepi Laut',                 2014),
            (         'Tepi Laut',                 2018),
            (   'Bukan Tepi Laut',                 2003),
            (   'Bukan Tepi Laut',                 2005),
            (   'Bukan Tepi Laut',                 2008),
            (   'Bukan Tepi Laut',                 2011),
            (   'Bukan Tepi Laut',                 2014),
            (   'Bukan Tepi Laut',                 2018)],
           )
===========menampilakan desa terbanyak=================
Area        Tepi Laut Bukan Tepi Laut total
Tahun            2018            2018
Provinsi
JAWA TENGAH       355            8204  8559

Area        Tepi Laut Bukan Tepi Laut   total
Tahun            2003            2003
Provinsi
JAWA TENGAH     334.0          8221.0  8555.0

Area        Tepi Laut Bukan Tepi Laut   total
Tahun            2005            2005
Provinsi
JAWA TENGAH     334.0          8230.0  8564.0

Area        Tepi Laut Bukan Tepi Laut   total
Tahun            2008            2008
Provinsi
JAWA TENGAH     329.0          8245.0  8574.0

Area        Tepi Laut Bukan Tepi Laut   total
Tahun            2011            2011
Provinsi
JAWA TENGAH     347.0          8230.0  8577.0

Area        Tepi Laut Bukan Tepi Laut total
Tahun            2014            2014
Provinsi
JAWA TENGAH       357            8221  8578

===========menampilakan desa tersedikit=================
Area        Tepi Laut Bukan Tepi Laut total
Tahun            2018            2018
Provinsi
DKI JAKARTA        15             252   267

Area        Tepi Laut Bukan Tepi Laut  total
Tahun            2003            2003
Provinsi
DKI JAKARTA      16.0           251.0  267.0

Area        Tepi Laut Bukan Tepi Laut  total
Tahun            2005            2005
Provinsi
DKI JAKARTA      16.0           251.0  267.0

Area        Tepi Laut Bukan Tepi Laut  total
Tahun            2008            2008
Provinsi
DKI JAKARTA      15.0           252.0  267.0

Area        Tepi Laut Bukan Tepi Laut  total
Tahun            2011            2011
Provinsi
DKI JAKARTA      16.0           251.0  267.0

Area        Tepi Laut Bukan Tepi Laut total
Tahun            2014            2014
Provinsi
DKI JAKARTA        16             251   267






<ipython-input-128-47ac89498a5f>:20: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  new_df['total']=df[('Tepi Laut', j)] + df[('Bukan Tepi Laut', j)]
<ipython-input-128-47ac89498a5f>:27: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  new_df['total']=df[('Tepi Laut', j)] + df[('Bukan Tepi Laut', j)]

Area                 Tepi Laut                                   \
Tahun                     2003   2005   2008   2011  2014  2018
Provinsi
ACEH                     507.0  660.0  678.0  761.0   748   723
SUMATERA UTARA           336.0  175.0  375.0  396.0   459   423
SUMATERA BARAT            80.0   99.0  102.0  116.0   127   132
RIAU                     346.0  406.0  186.0  232.0   271   254
JAMBI                     28.0   28.0   28.0   29.0    30    28
SUMATERA SELATAN          16.0   19.0   22.0   34.0    29    25
BENGKULU                 134.0  157.0  166.0  182.0   186   184
LAMPUNG                  170.0  186.0  203.0  231.0   241   231
KEP. BANGKA BELITUNG     122.0  105.0  137.0  163.0   166   160
KEP. RIAU                  NaN    NaN  267.0  299.0   361   355
DKI JAKARTA               16.0   16.0   15.0   16.0    16    15
JAWA BARAT               219.0  193.0  217.0  217.0   227   221
JAWA TENGAH              334.0  334.0  329.0  347.0   357   355
DI YOGYAKARTA             30.0   32.0   33.0   33.0    33    33
JAWA TIMUR               567.0  571.0  611.0  655.0   678   655
BANTEN                   114.0  123.0  124.0  131.0   135   133
BALI                     150.0  156.0  167.0  177.0   175   175
NUSA TENGGARA BARAT      183.0  184.0  241.0  279.0   301   297
NUSA TENGGARA TIMUR      768.0  815.0  841.0  943.0  1011  1018
KALIMANTAN BARAT         130.0  138.0  153.0  163.0   161   158
KALIMANTAN TENGAH         40.0   34.0   41.0   45.0    44    45
KALIMANTAN SELATAN       135.0  131.0  135.0  166.0   165   165
KALIMANTAN TIMUR         131.0  168.0  179.0  218.0   175   156
KALIMANTAN UTARA           NaN    NaN    NaN    NaN    55    56
SULAWESI UTARA           456.0  509.0  627.0  721.0   778   783
SULAWESI TENGAH          684.0  770.0  839.0  901.0  1021  1011
SULAWESI SELATAN         547.0  547.0  485.0  504.0   531   527
SULAWESI TENGGARA        590.0  658.0  771.0  813.0   947   954
GORONTALO                 82.0  110.0  136.0  191.0   203   201
SULAWESI BARAT             NaN    NaN  122.0  148.0   152   152
MALUKU                   708.0  733.0  772.0  859.0   914  1064
MALUKU UTARA             551.0  568.0  772.0  856.0   941   934
PAPUA BARAT                NaN    NaN  416.0  536.0   543   572
PAPUA                    846.0  827.0  474.0  522.0   646   662

Area                 Bukan Tepi Laut
Tahun                           2003    2005    2008    2011  2014  2018
Provinsi
ACEH                          5229.0  5308.0  5746.0  5722.0  5764  5785
SUMATERA UTARA                5043.0  4740.0  5392.0  5401.0  5645  5709
SUMATERA BARAT                 795.0   802.0   822.0   917.0  1018  1143
RIAU                          1279.0  1326.0  1418.0  1423.0  1564  1621
JAMBI                         1161.0  1207.0  1275.0  1343.0  1521  1534
SUMATERA SELATAN              2691.0  2759.0  3057.0  3152.0  3208  3237
BENGKULU                      1029.0  1067.0  1185.0  1327.0  1346  1330
LAMPUNG                       1958.0  2005.0  2136.0  2233.0  2391  2423
KEP. BANGKA BELITUNG           195.0   216.0   207.0   198.0   215   231
KEP. RIAU                        NaN     NaN    59.0    54.0    54    61
DKI JAKARTA                    251.0   251.0   252.0   251.0   251   252
JAWA BARAT                    5539.0  5615.0  5654.0  5688.0  5735  5736
JAWA TENGAH                   8221.0  8230.0  8245.0  8230.0  8221  8204
DI YOGYAKARTA                  408.0   406.0   405.0   405.0   405   405
JAWA TIMUR                    7898.0  7906.0  7894.0  7847.0  7824  7841
BANTEN                        1365.0  1359.0  1380.0  1404.0  1416  1419
BALI                           536.0   545.0   545.0   539.0   541   541
NUSA TENGGARA BARAT            555.0   636.0   672.0   805.0   840   846
NUSA TENGGARA TIMUR           1782.0  1923.0  1962.0  2023.0  2259  2335
KALIMANTAN BARAT              1309.0  1392.0  1638.0  1804.0  1948  1979
KALIMANTAN TENGAH             1290.0  1317.0  1407.0  1483.0  1525  1531
KALIMANTAN SELATAN            1814.0  1828.0  1839.0  1834.0  1843  1843
KALIMANTAN TIMUR              1168.0  1176.0  1238.0  1247.0   851   882
KALIMANTAN UTARA                 NaN     NaN     NaN     NaN   424   426
SULAWESI UTARA                 740.0   760.0   867.0   972.0  1058  1055
SULAWESI TENGAH                756.0   760.0   847.0   914.0   965  1009
SULAWESI SELATAN              2537.0  2739.0  2461.0  2478.0  2499  2522
SULAWESI TENGGARA              974.0  1027.0  1257.0  1308.0  1325  1400
GORONTALO                      294.0   340.0   448.0   540.0   533   533
SULAWESI BARAT                   NaN     NaN   414.0   490.0   496   498
MALUKU                         128.0   140.0   134.0   165.0   174   176
MALUKU UTARA                   190.0   213.0   264.0   223.0   255   262
PAPUA BARAT                      NaN     NaN   789.0   903.0  1024  1415
PAPUA                         2661.0  2512.0  2837.0  3402.0  4225  4890

In [129]:
df.describe()

Area    Tepi Laut                                                   \
Tahun        2003        2005        2008        2011         2014
count   30.000000   30.000000   33.000000   33.000000    34.000000
mean   300.666667  315.066667  323.151515  360.121212   377.264706
std    255.430041  272.511934  269.435535  294.773192   325.065803
min     16.000000   16.000000   15.000000   16.000000    16.000000
25%    116.000000  113.250000  135.000000  163.000000   154.250000
50%    176.500000  179.500000  203.000000  231.000000   234.000000
75%    537.000000  562.750000  485.000000  536.000000   620.250000
max    846.000000  827.000000  841.000000  943.000000  1021.000000

Area               Bukan Tepi Laut                                         \
Tahun         2018            2003         2005         2008         2011
count    34.000000       30.000000    30.000000    33.000000    33.000000
mean    378.147059     1993.200000  2016.833333  1962.000000  2021.969697
std     333.856722     2194.354235  2182.446809  2176.117443  2167.101326
min      15.000000      128.000000   140.000000    59.000000    54.000000
25%     153.000000      601.250000   667.000000   545.000000   540.000000
50%     226.000000     1223.500000  1262.000000  1257.000000  1327.000000
75%     634.250000     2392.250000  2385.250000  2136.000000  2233.000000
max    1064.000000     8221.000000  8230.000000  8245.000000  8230.000000

Area
Tahun         2014         2018
count    34.000000    34.000000
mean   2040.088235  2090.411765
std    2183.049068  2201.595085
min      54.000000    61.000000
25%     535.000000   535.000000
50%    1335.500000  1407.500000
75%    2358.000000  2401.000000
max    8221.000000  8204.000000

In [130]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 34 entries, ACEH to PAPUA
Data columns (total 12 columns):
(Tepi Laut, 2003)          30 non-null float64
(Tepi Laut, 2005)          30 non-null float64
(Tepi Laut, 2008)          33 non-null float64
(Tepi Laut, 2011)          33 non-null float64
(Tepi Laut, 2014)          34 non-null int64
(Tepi Laut, 2018)          34 non-null int64
(Bukan Tepi Laut, 2003)    30 non-null float64
(Bukan Tepi Laut, 2005)    30 non-null float64
(Bukan Tepi Laut, 2008)    33 non-null float64
(Bukan Tepi Laut, 2011)    33 non-null float64
(Bukan Tepi Laut, 2014)    34 non-null int64
(Bukan Tepi Laut, 2018)    34 non-null int64
dtypes: float64(8), int64(4)
memory usage: 4.7+ KB